Repository: yunsii/lingui-examples-nextjs-swc
Catalog: src/locales/src/pages/index.page/*.po
Languages: es

source: {0, plural, one {# Person} other {# Persons}}
es: {0, plural, one {# ES Person} other {# ES Persons}}

source: <0>Next.js</0>say hi.
es: ES <0>Next.js</0>say hi.

source: English
es: ES English

source: Plain text
es: ES Plain text

source: Serbian
es: ES Serbian

source: Spanish
es: ES Spanish

source: Translation Demo
es: ES Translation Demo

source: Welcome to <0>Next.js!</0>
es: ES Welcome to <0>Next.js!</0>

source: Wonderful framework <0>Next.js</0>say hi.
es: ES Wonderful framework <0>Next.js</0>say hi.

source: Wonderful framework <0>Next.js</0>say hi. And <1>Next.js</1>say hi.
es: ES Wonderful framework <0>Next.js</0>say hi. And <1>Next.js</1>say hi.
